package lessons

fun main() {
    println("1. Весь код который мы создаем на языке Kotlin должен быть написан внутри файлов с расширением .kt")
    println(
        "2. Файлу необходимо дать имя:\n" +
                "- С заглавной буквы\n" +
                "- Использовать английский язык, никакого транслита!\n" +
                "- Каждое следующее слово с заглавной буквы без нижнего подчеркивания и пробелов"
    )
    println("3. Для обозначения точки входа в программу создайте функцию lessons.lessons.main()")
}