package Tasks

/**
 * Напишите программу расчета стоимости доставки:
 * Пользователь вводит вес груза
 * Программа выводит в консоль: _ руб./км.
 * Внимание - "до n кг" означает меньше n(не включительно), то есть запись "до 2 кг." означает от 0 до 1,99999...кг
 * до 2 кг. - 150 руб./км.
 * до 5 кг. - 200 руб./км.
 * до 12 кг. - 250 руб./км.
 * до 18 кг. - 300 руб./км.
 * до 30 кг. - 350 руб./км.
 * до 200 кг. - 1000 руб./км.
 * 200кг и более - Для расчета стоимости свяжитесь с менеджером.
 */
fun main() {
    val weight = readLine()!!.toDouble();

//    val price = if (weight > 0 && weight <= 1.99999) {
//        "150 руб./км."
//    } else if (weight > 1.99999 && weight <= 4.99999) {
//        "200 руб./км."
//    } else if (weight > 4.99999 && weight <= 11.99999) {
//        "250 руб./км."
//    } else if (weight > 11.99999 && weight <= 17.99999) {
//        "300 руб./км."
//    } else if (weight > 17.99999 && weight <= 29.99999) {
//        "350 руб./км."
//    } else if (weight > 29.99999 && weight <= 199.99999) {
//        "1000 руб./км."
//    } else {
//        "Для расчета стоимости свяжитесь с менеджером."
//    }
//
//    println(price)//

    // через when
    val price = when (weight) {
        in 0.0..1.99999 -> "150 руб./км."
        in 2.0..4.99999 -> "200 руб./км."
        in 5.0..11.99999 -> "250 руб./км."
        in 12.0..17.99999 -> "300 руб./км."
        in 18.0..29.99999 -> "350 руб./км."
        in 30.0..199.99999 -> "1000 руб./км."
        else -> "Для расчета стоимости свяжитесь с менеджером."
    }
    println(price);
}